Park_Jongyong_HW_2/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'PG-13'  ORDER BY release_date
---
    def index
      @all_ratings = ['G','PG','PG-13','R']
      @sort = params[:sort]
      @selectrating = params[:ratings]

      if @sort.present?
        session[:sort] = @sort
      end
      if @selectrating.present?
        session[:ratings] = @selectrating
      end

      if (@selectrating.nil? && session[:ratings].nil?)
        @movies = Movie.with_ratings(@all_ratings).order(session[:sort])